(idp) C:\zjy\demo\tf\mnist>python lenet5_v2.py
Using TensorFlow backend.
Input 32*32
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 28, 28, 6)         156          (5*5+1)*6
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 14, 14, 6)         0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 10, 10, 16)        2416         (6*5*5+1)*16
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 5, 5, 16)          0
_________________________________________________________________
flatten_1 (Flatten)          (None, 400)               0
_________________________________________________________________
dense_1 (Dense)              (None, 120)               48120        (400+1)*120
_________________________________________________________________
dense_2 (Dense)              (None, 84)                10164        (120+1)*84
_________________________________________________________________
dense_3 (Dense)              (None, 10)                850          (84+1)*10
=================================================================
Total params: 61,706
Trainable params: 61,706
Non-trainable params: 0